Revit 2024 API
LineProperties.Color Property
 The current color used when drawing lines/curves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public Color Color { get; }
Visual Basic
Public ReadOnly Property Color As Color
	Get
Visual C++
public:
property Color^ Color {
	Color^ get ();
}
See Also
LineProperties Class
Autodesk.Revit.DB Namespace